[
    {
        "bookId": 1,
        "bookName": "The Girl on the Train",
        "author": "Paula Hawkins",
        "image": "https://i.ibb.co/rZpztGr/image.png",
        "review": "A gripping psychological thriller that keeps you guessing until the very end. Paula Hawkins masterfully crafts a story filled with suspense and intrigue, drawing readers into the lives of complex characters and their intertwined narratives. As the protagonist, Rachel, becomes entangled in a web of deceit and obsession, the tension builds, leading to a shocking revelation that will leave you breathless. With its fast-paced plot and clever twists, 'The Girl on the Train' is a must-read for fans of the genre.",
        "totalPages": 336,
        "rating": 4.0,
        "category": "Thriller",
        "tags": ["Suspense", "Mystery"],
        "publisher": "Riverhead Books",
        "yearOfPublishing": 2015
    },
    {
        "bookId": 2,
        "bookName": "Educated",
        "author": "Tara Westover",
        "image": "https://i.ibb.co/0Qdz6tG/image.png",
        "review": "A powerful memoir of resilience and self-discovery, 'Educated' chronicles Tara Westover's remarkable journey from a childhood in rural Idaho to earning a PhD from Cambridge University. With courage and determination, Westover recounts her struggles to break free from the constraints of her upbringing in a strict, survivalist family, where education was discouraged. Her story is a testament to the transformative power of learning and the human spirit's capacity for growth and change. 'Educated' is a deeply moving and inspiring memoir that will resonate with readers long after the final page.",
        "totalPages": 352,
        "rating": 4.6,
        "category": "Biography",
        "tags": ["Memoir", "Autobiography"],
        "publisher": "Random House",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 3,
        "bookName": "The Night Circus",
        "author": "Erin Morgenstern",
        "image": "https://i.ibb.co/1GQzpvL/image.png",
        "review": "A mesmerizing tale of magic, love, and enchantment set within the mysterious confines of a traveling circus. Erin Morgenstern's lyrical prose transports readers to a world where dreams and reality blur, as two young magicians, Celia and Marco, engage in a fierce competition under the watchful eye of their enigmatic mentors. As the circus unfolds, with its wondrous attractions and ethereal performances, Morgenstern weaves a spellbinding narrative filled with intrigue and wonder. 'The Night Circus' is a captivating masterpiece that will leave you spellbound from beginning to end.",
        "totalPages": 400,
        "rating": 4.3,
        "category": "Fantasy",
        "tags": ["Magic", "Romance"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 4,
        "bookName": "The Silent Patient",
        "author": "Alex Michaelides",
        "image": "https://i.ibb.co/hDPLfXM/image.png",
        "review": "A twisty and atmospheric psychological thriller that will keep you guessing until the very end. Alex Michaelides crafts a chilling tale of murder, madness, and deception, as psychotherapist Theo Faber unravels the mystery behind his patient Alicia Berenson's silence. With its intricate plot and unreliable narrators, 'The Silent Patient' keeps readers on the edge of their seats, questioning everything they thought they knew. Michaelides delivers a gripping and suspenseful debut that will haunt you long after you turn the final page.",
        "totalPages": 336,
        "rating": 4.2,
        "category": "Thriller",
        "tags": ["Suspense", "Mystery", "Psychological"],
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
    },
    {
        "bookId": 5,
        "bookName": "Where the Crawdads Sing",
        "author": "Delia Owens",
        "image": "https://i.ibb.co/Jvh6Dd3/image.png",
        "review": "A breathtaking mystery and coming-of-age story set in the marshes of North Carolina. Delia Owens paints a vivid portrait of Kya Clark, the 'Marsh Girl,' as she navigates the complexities of love, loss, and survival in the untamed wilderness. As Kya becomes embroiled in a murder investigation, Owens skillfully weaves together past and present, building suspense and intrigue until the shocking truth is revealed. 'Where the Crawdads Sing' is a lyrical and evocative novel that captures the beauty and brutality of nature, leaving an indelible mark on the reader's soul.",
        "totalPages": 384,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Nature", "Coming-of-age", "Mystery"],
        "publisher": "G.P. Putnam's Sons",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 6,
        "bookName": "Circe",
        "author": "Madeline Miller",
        "image": "https://i.ibb.co/V2v66pt/image.png",
        "review": "A spellbinding retelling of Greek mythology from the perspective of the enchantress Circe. Madeline Miller breathes new life into the ancient tale, giving voice to a character often relegated to the sidelines of myth. Through Circe's eyes, we witness the trials and triumphs of gods and mortals alike, as she navigates the complexities of power, love, and destiny. Miller's prose is lyrical and luminous, transporting readers to a world of magic and myth. 'Circe' is a mesmerizing journey that will captivate fans of mythology and fantasy.",
        "totalPages": 400,
        "rating": 4.4,
        "category": "Fantasy",
        "tags": ["Mythology", "Retelling"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 7,
        "bookName": "It Ends with Us",
        "author": "Colleen Hoover",
        "image": "https://i.ibb.co/88YSGpb/image.png",
        "review": "A heartbreaking and powerful contemporary romance that tackles difficult subjects with grace and empathy. Colleen Hoover delves into the complexities of love, loss, and resilience, as protagonist Lily Bloom grapples with the consequences of her past and the choices that shape her future. With its raw emotion and authentic portrayal of relationships, 'It Ends with Us' is a poignant and thought-provoking novel that explores the true meaning of courage and forgiveness. Hoover's storytelling prowess shines in this compelling and unforgettable tale.",
        "totalPages": 384,
        "rating": 4.5,
        "category": "Romance",
        "tags": ["Contemporary", "Relationships"],
        "publisher": "Atria Books",
        "yearOfPublishing": 2016
    },
    {
        "bookId": 8,
        "bookName": "Weyward",
        "author": "Emilia Hart",
        "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1677756582i/60654349.jpg",
        "review": "Weaving together the stories of three extraordinary women across five centuries, Emilia Hart's 'Weyward' is an enthralling novel of female resilience and the transformative power of the natural world. Set across different time periods – 1619, 1942, and 2019 – the novel intricately intertwines the lives of Kate, Altha, and Violet, each grappling with their own struggles and secrets. Through vivid prose and richly drawn characters, Hart explores themes of family, identity, and the enduring power of nature. 'Weyward' is a spellbinding journey that transports readers across centuries, leaving them spellbound by its timeless tale of courage and resilience.",
        "totalPages": 329,
        "rating": 4.09,
        "category": "Historical Fiction",
        "tags": ["Female Resilience", "Natural World"],
        "publisher": "St. Martin's Press",
        "yearOfPublishing": 2023
    },
    {
        "bookId": 9,
        "bookName": "The Three-Body Problem",
        "author": "Liu Cixin",
        "image": "https://i.ibb.co/TqM6jQF/image.png",
        "review": "Dive into the mind-bending world of 'The Three-Body Problem' by Liu Cixin. This groundbreaking science fiction novel explores themes of physics, philosophy, and the fate of humanity in the face of an impending alien invasion. Cixin's narrative is both intellectually stimulating and emotionally resonant, drawing readers into a thought-provoking exploration of the universe and our place within it. With its imaginative premise and intricate plotting, 'The Three-Body Problem' is a must-read for fans of hard science fiction.",
        "totalPages": 400,
        "rating": 4.5,
        "category": "Science Fiction",
        "tags": ["Aliens", "Physics", "Philosophy"],
        "publisher": "Tor Books",
        "yearOfPublishing": 2008
    }
    
]